app/views/users/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 92]]
---
              <%= image_tag post.user.picture, class:'avatar' %> <br>
              Ecrit par <%= post.user.first_name %>