app/views/users/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 144]]
---
      <h4>Articles de <%= @user.first_name %> <%=@user.last_name %></h4>
      <% @user.posts.each do |post| %>