app/views/pages/home.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 44]]
---
              <p class="card-post-author">
                Publié par <%= post.user.first_name %>