app/views/posts/index.html.erb

              <% end %>
              Ecrit par <%= post.user.first_name %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 44]]