app/views/posts/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 92]]
---
              <%= link_to user_path(@post.user) do  %>
                <%= @post.user.first_name %>

SELECT "uploads".* FROM "uploads" WHERE "uploads"."post_id" = $1  [["post_id", 44]]
---
          <ul class="list-unstyled">
            <% @post.uploads.each do |upload| %>