app/controllers/posts_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 92]]
---
  def show
    @post = Post.find([:user][:id])