app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.new(post_params)
    authorize @post
    if @post.save
---
INSERT INTO "posts" ("title", "introduction", "content", "status", "synopsis", "city", "category", "price", "licence", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

  def update
    if @post.update(post_params)
---
UPDATE "posts" SET "content" = $1, "category" = $2, "licence" = $3, "updated_at" = $4 WHERE "posts"."id" = $5  [["content", "Hi coucou  ca va ? \r\ncoucou **Google**"], ["category", "Société"], ["licence", "Copyright"], ["updated_at", "2015-11-30 13:44:00.092409"], ["id", 45]]